# language: ru
# encoding: utf-8

Функционал: Тут есть подсценарии




Сценарий: Шаг принимает одну таблицу и два парметра обычных

	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной1"
		|'Колонка1'|'Колонка2'|'Колонка3'|
		|'Значение1'|'Значение2'|'Значение3'|
		|'Значение4'|'Значение5'|'Значение6'|


Сценарий: Шаг принимает одну таблицу и два парметра обычных

	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной1"
		|'Колонка1'|'Колонка2'|'Колонка3'|
		|'Значение1'|'Значение2'|'Значение3'|
		|'Значение4'|'Значение5'|'Значение6'|
		
		|'Колонка11'|'Колонка22'|'Колонка33'|
		|'Значение11'|'Значение22'|'Значение33'|
		|'Значение44'|'Значение55'|'Значение66'|
