# language: ru
# encoding: utf-8

@ТегФичи1
@ТегФичи2
Функционал: <описание фичи>

Как программист
Я хочу
Чтобы результат

Контекст:
	@ТегШага111
	@ТегШага222
	#Коммент111111111111
	//Коммент22222222222
	И Я закрыл все окна клиентского приложения

#Коммент1
//Коммент2
@ТегСценария1
@ТегСценария2
Сценарий: Тест один

	@ТегШага1
	@ТегШага2
	#Коммент11
	//Коммент22
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной1"
	
	
#Коммент11
//Коммент22
@ТегСценария11
@ТегСценария22
Сценарий: Тест один

	@ТегШага11
	@ТегШага22
	#Коммент1111
	//Коммент2222
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной1"
