#Область НаборТестов

&НаКлиенте
Процедура ЗаполнитьНаборТестов(ЮнитТест, Интерактивно = Ложь) Экспорт
	
	ЮнитТест.Добавить("Тест_ИнициализацияБиблиотеки", "Инициализация библиотеки");
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_ИнициализацияБиблиотеки(Ожидается) Экспорт
	
	ИменаКомпонент = Новый Структура("GherkinParser");
	Для каждого КлючЗначение из ИменаКомпонент Цикл
		ИмяКомпоненты = "AddIn." + Ожидается.ИдентификаторКомпоненты + "." + КлючЗначение.Ключ;
		Ожидается.Тест().Компонента(КлючЗначение.Ключ).ИмеетТип(ИмяКомпоненты);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти